## Bonus (Optional)

#### As you examine the data, you are overcome with a creeping suspicion that the dataset is fake. You surmise that your boss handed you spurious data in order to test the data engineering skills of a new employee. To confirm your hunch, you decide to take the following steps to generate a visualization of the data, with which you will confront your boss:

In [1]:
# Importing Dependencies
import pandas as pd
from sqlalchemy import create_engine
import matplotlib.pyplot as plt
import numpy as np
from password import key

### Import the SQL database into Pandas

In [2]:
# Establish Connection
engine = create_engine(f'postgresql://postgres:{key}@localhost:5432/EmployeeSQL')
conn = engine.connect()

### Query the database

In [3]:
# Query Employees Table
employees_df = pd.read_sql("SELECT * FROM employees", conn)
employees_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [4]:
# Query Salaries Table
salaries_df = pd.read_sql("SELECT * FROM salaries", conn)
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [5]:
# Query Titles Table
titles_df = pd.read_sql("SELECT * FROM titles", conn)
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [6]:
# Query Dept_emp Table
dept_emp_df = pd.read_sql("SELECT * FROM dept_emp", conn)
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [7]:
# Query Departments Table
departments_df = pd.read_sql("SELECT * FROM departments", conn)
departments_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [8]:
# Query Dept_Manager Table
dept_manager_df = pd.read_sql('Select * FROM dept_manager', conn)
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

### Prep dataframes for Plotting

In [9]:
# Merge employees_df and salaries_df
employee_salaries = pd.merge(employees_df,salaries_df, on = 'emp_no')
employee_salaries.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000

In [10]:
# Check for NAN
employee_salaries.isnull().values.any()

False

In [11]:
employee_salaries.count()

emp_no          300024
emp_title_id    300024
birth_date      300024
first_name      300024
last_name       300024
sex             300024
hire_date       300024
salary          300024
dtype: int64

In [13]:
employee_dept = pd.merge(employee_salaries,dept_emp_df, on = "emp_no", how = 'left')
employee_dept.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,d002
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422,d004
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973,d004
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,d003
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000,d006

In [17]:
employee_departments = pd.merge(employee_dept,departments_df, on = 'dept_no', how = 'left')
employee_departments.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no,dept_name
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,d002,Finance
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422,d004,Production
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973,d004,Production
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,d003,Human Resources
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000,d006,Quality Management

In [18]:
# Check for NAN
employee_departments.isnull().values.any()

False

In [24]:
employee_manager = pd.merge(employee_departments,dept_manager_df, on = 'emp_no', how = 'left')
employee_manager.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no_x,dept_name,dept_no_y
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,d002,Finance,NaN
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422,d004,Production,NaN
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973,d004,Production,NaN
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,d003,Human Resources,NaN
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000,d006,Quality Management,NaN

In [21]:
# Check for NAN
employee_manager.isnull().values.any()

True

In [25]:
employee_df = employee_manager.rename(columns={'emp_title_id':'title_id', 'dept_no_x': 'dept_no'})
employee_df = employee_df.drop(columns = ['dept_no_y',])
employee_df.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no,dept_name
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,d002,Finance
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422,d004,Production
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973,d004,Production
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,d003,Human Resources
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000,d006,Quality Management

In [26]:
employee_df.isnull().values.any()

False

In [30]:
employee_title = pd.merge(employee_df, titles_df, on = 'title_id')
employee_title.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary,dept_no,dept_name,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,d002,Finance,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,d003,Human Resources,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,56087,d003,Human Resources,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,87084,d007,Sales,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,63016,d002,Finance,Staff

In [31]:
employee_title.isnull().values.any()

False

### Create a histogram to visualize the most common salary ranges for employees.

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.
print(f"The mean salary of all employees is: {round(employee_salaries.salary.mean(),2)}")
print(f"The standard deviation of all Employees's salary is: {round(employee_salaries.salary.std(),2)}")
plt.hist(employee_salaries.salary, bins = 15)
plt.xlabel("Common Salary Ranges")
plt.ylabel("Number of Employees")
plt.show()

### Create a bar chart of average salary by title.